[
  {
    "article_title": "The name.com API: Modern domain experiences that ship fast and convert (Sponsor)",
    "article_description": "✅ Trusted by Vercel, Replit, Netlify, and Bolt\n\n\n\nWhat: A simple, modern API that enables developers to integrate domain name\nsearch, purchase, and management directly into their apps.\n\nWhy: Legacy APIs take months of custom development. The name.com API\n[https://www.name.com/nameapi?utm_source=tldr-webdev&utm_medium=newsletter-p2&utm_campaign=name_reseller]\nis built to OpenAPI spec with AI-enabled docs and MCP support—ship to production\nin days.\n\nHow: Just get your API token and get started. It's free to use with transparent,\nvolume-based domain pricing.\n\nGet started for free\n[https://www.name.com/nameapi?utm_source=tldr-webdev&utm_medium=newsletter-p2&utm_campaign=name_reseller]",
    "article_link": "https://www.name.com/nameapi?utm_source=tldr-webdev&amp;utm_medium=newsletter-p2&amp;utm_campaign=name_reseller"
  },
  {
    "article_title": "Where to use sub-agents versus agents as tools (6 minute read)",
    "article_description": "This article explains when to use sub-agents versus agents as tools when\nbuilding multi-agent AI systems. The main difference is that agents as tools are\nself-contained, stateless specialists ideal for discrete tasks (like converting\nnatural language to SQL), while sub-agents are delegated team members that share\ncontext and handle complex, multi-step processes requiring ongoing collaboration\n(like managing flight bookings with multiple user interactions). Tools should be\nused for reusable, atomic functions, while sub-agents are better for stateful\nworkflows that need access to conversational history and broader mission\ncontext.",
    "article_link": "https://cloud.google.com/blog/topics/developers-practitioners/where-to-use-sub-agents-versus-agents-as-tools?utm_source=tldrwebdev"
  },
  {
    "article_title": "How when AWS was down, we were not (47 minute read)",
    "article_description": "Authress' auth solution remained operational during a recent AWS us-east-1\noutage that impacted major companies. This was thanks to avoiding unreliable\nthird-party components, implementing DNS failover with custom health checks, and\nusing edge compute via CloudFront and Lambda@Edge. It also used incremental\nrollouts to reduce the impact of application failures, a web application\nfirewall (WAF) for handling malicious requests, and prioritized customer support\nfor issues outside of automated detection.",
    "article_link": "https://authress.io/knowledge-base/articles/2025/11/01/how-we-prevent-aws-downtime-impacts?utm_source=tldrwebdev"
  },
  {
    "article_title": "How Dash uses context engineering for smarter AI (8 minute read)",
    "article_description": "Dropbox evolved its Dash AI system from a traditional search tool into an\n\"agentic AI\" that can interpret, summarize, and act on information. Its team\ndiscovered that adding more tools and context often led to worse performance due\nto analysis paralysis and \"context rot,\" so they developed three key strategies:\nlimiting tool definitions by consolidating multiple retrieval options into a\nsingle universal search tool, filtering context to show only the most relevant\ninformation using a knowledge graph, and creating specialized agents for complex\ntasks like search query construction.",
    "article_link": "https://dropbox.tech/machine-learning/how-dash-uses-context-engineering-for-smarter-ai?utm_source=tldrwebdev"
  },
  {
    "article_title": "Things I Don't Like in Configuration Languages (11 minute read)",
    "article_description": "This dev is not impressed with existing configuration languages like YAML, XML,\nJSON, TOML, and many others. They are overly complex, don't have some basic\nfeatures, or are just programming languages disguised as configuration formats.\nTo address these shortcomings, he created his own configuration language called\nMAML based on JSON.",
    "article_link": "https://medv.io/blog/things-i-dont-like-in-configuration-languages?utm_source=tldrwebdev"
  },
  {
    "article_title": "OOP: the worst thing that happened to programming (28 minute read)",
    "article_description": "Object-Oriented Programming (OOP) is the worst thing that happened to\nprogramming due to its inherent flaws and unnecessary complexity compared to\nFunctional Programming (FP). Core OOP concepts like methods, inheritance, and\npolymorphism lead to the need for complex design patterns as workarounds. OOP\nalso leads to verbose, bug-prone code, and developers deeply entrenched in OOP\noften fail to recognize its shortcomings.",
    "article_link": "https://alexanderdanilov.dev/en/articles/oop?utm_source=tldrwebdev"
  },
  {
    "article_title": "A primer on building successful AI agents (Sponsor)",
    "article_description": "Moving agents from dev to prod is challenging due to quality, governance, and\nsecurity concerns. Discover proven workflows, frameworks, and observability\ntools that help you build reliable agents and deploy them confidently. Get the\nguide\n[https://wandb.ai/site/resources/whitepapers/building-successful-ai-agents/?utm_source=tldr-dev&utm_medium=cpc&utm_campaign=WP-AIAgentsPrimer&utm_content=NewGuide-AIAgentsPrimer&utm_term=newsletter].",
    "article_link": "https://wandb.ai/site/resources/whitepapers/building-successful-ai-agents/?utm_source=tldr-dev&amp;utm_medium=cpc&amp;utm_campaign=WP-AIAgentsPrimer&amp;utm_content=NewGuide-AIAgentsPrimer&amp;utm_term=newsletter"
  },
  {
    "article_title": "PrinceJS (Website)",
    "article_description": "PrinceJS is a fast, lightweight, and tree-shakable Bun framework with features\nlike type safety, middleware, validation, and utilities for caching, email,\nuploads, cron jobs, and OpenAPI documentation.",
    "article_link": "https://princejs.vercel.app/?utm_source=tldrwebdev"
  },
  {
    "article_title": "Continuous Claude (GitHub Repo)",
    "article_description": "Continuous Claude is a script that automates the pull request lifecycle using\nClaude Code. It commits changes to a new branch, creates a pull request, waits\nfor checks and reviews, and merges the PR, repeating until the task is complete.",
    "article_link": "https://github.com/AnandChowdhary/continuous-claude?utm_source=tldrwebdev"
  },
  {
    "article_title": "Parqeye (GitHub Repo)",
    "article_description": "Parqeye is a terminal-based tool that allows users to inspect Parquet files. It\nprovides interactive data visualization, schema exploration, file metadata\nviewing, and row group statistics examination, all within a tab-based interface.\nUsers can install Parqeye via direct download, building from source, or through\nCargo. It's released under the MIT License.",
    "article_link": "https://github.com/kaushiksrini/parqeye?utm_source=tldrwebdev"
  },
  {
    "article_title": "Enhancing HDR on Instagram for iOS With Dolby Vision (10 minute read)",
    "article_description": "Instagram for iOS is now the first Meta app to support Dolby Vision video, which\nimproves the HDR viewing experience by preserving amve and Dolby Vision\nmetadata. Initially, Instagram's video processing, which uses FFmpeg, discarded\nthis metadata, impacting picture quality. By collaborating with Dolby and FFmpeg\ndevelopers, Meta implemented support for Dolby Vision and amve in its video\nprocessing pipeline.",
    "article_link": "https://engineering.fb.com/2025/11/17/ios/enhancing-hdr-on-instagram-for-ios-with-dolby-vision/?utm_source=tldrwebdev"
  },
  {
    "article_title": "So long, and thanks for all the fish: how to escape the Linux networking stack\n(11 minute read)",
    "article_description": "Cloudflare uses soft-unicast to share IP addresses across machines, pushing the\nlimits of the Linux networking stack. It attempted to create a service called\n\"fish\" to proxy IP packets using soft-unicast, but encountered issues with\nLinux's socket subsystem and Netfilter conntrack module. To solve these issues,\nit explored using Netlink, TCP_REPAIR, and manipulating routing rules,\nultimately terminating TCP connections instead of forwarding IP packets.",
    "article_link": "https://blog.cloudflare.com/so-long-and-thanks-for-all-the-fish-how-to-escape-the-linux-networking-stack/?utm_source=tldrwebdev"
  },
  {
    "article_title": "Project Gemini (Website)",
    "article_description": "Project Gemini is a lightweight internet protocol focused on providing a simple,\nprivacy-respecting space for interconnected text documents.",
    "article_link": "https://geminiprotocol.net/?utm_source=tldrwebdev"
  },
  {
    "article_title": "Microsoft: Azure hit by 15 Tbps DDoS attack using 500,000 IP addresses (3 minute\nread)",
    "article_description": "Microsoft Azure was hit by a 15 Tbps DDoS attack originating from the Aisuru\nbotnet, a Turbo Mirai-class IoT botnet comprising over 500,000 IP addresses that\nhas also been linked to other recent record-breaking DDoS attacks and malicious\nactivity.",
    "article_link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-aisuru-botnet-used-500-000-ips-in-15-tbps-azure-ddos-attack/?utm_source=tldrwebdev"
  },
  {
    "article_title": "I caught Google Gemini using my data—and then covering it up (1 minute read)",
    "article_description": "The author discovered that Google Gemini accessed and used their personal data\nabout their past use of the tool Alembic without their explicit permission, and\nthen attempted to conceal this data access by lying about it.",
    "article_link": "https://unbuffered.stream/gemini-personal-context/?utm_source=tldrwebdev"
  },
  {
    "article_title": "Run Ancient Unix (GitHub Repo)",
    "article_description": "This repository provides the necessary tools and instructions to easily run\nvarious ancient UNIX versions, including those for PDP-11 and x86 architectures,\non modern operating systems using simulators like SIMH and QEMU.",
    "article_link": "https://github.com/felipenlunkes/run-ancient-unix?utm_source=tldrwebdev"
  }
]